Repository: tabtin-ai/TabTin
Catalog: apps/tabtin-ios/Tabtin/Resources/Localizations/Agent.xcstrings
Source language: zh_hans
Languages: en

# spaceList.emptyTitle
source: 暂无工作空间
en: No Workspaces

# spaceList.emptyDescription
source: 请先在电脑端创建可执行工作空间，随后会显示在这里
en: Create an execution Workspace on desktop and it will appear here

# spaceList.creationBoundary
source: 新建工作空间请在电脑版 TabTin 中完成。
en: Create new Workspaces in TabTin for desktop.

# spaceList.searchPlaceholder
source: 搜索工作空间
en: Search Workspaces

# spaceList.notFound
source: 工作空间不存在
en: Workspace not found

# spaceList.editTitle
source: 编辑工作空间
en: Edit Workspace

# spaceList.editNamePlaceholder
source: 工作空间名称
en: Workspace name

# spaceList.editDescriptionPlaceholder
source: 工作空间描述（可选）
en: Workspace description (optional)

# spaceList.primaryAgent.named
source: 主要 Agent · %@
en: Primary Agent · %@

# spaceList.primaryAgent.unassigned
source: 主要 Agent · 未设置
en: Primary Agent · Not set

# spaceList.primaryAgent.loading
source: 主要 Agent · 加载中
en: Primary Agent · Loading

# spaceList.primaryAgent.unavailable
source: 主要 Agent · 信息暂不可用
en: Primary Agent · Info unavailable

# spaceList.executionDevice.namedStatus
source: 执行设备 · %@ · %@
en: Device · %@ · %@

# spaceList.executionDevice.unbound
source: 执行设备 · 未连接
en: Device · Not connected

# spaceList.executionDevice.loading
source: 执行设备 · 加载中
en: Device · Loading

# spaceList.executionDevice.unavailable
source: 执行设备 · 信息暂不可用
en: Device · Info unavailable

# spaceList.executionDevice.unnamed
source: 未命名设备
en: Unnamed device

# spaceList.deviceStatus.online
source: 在线
en: Online

# spaceList.deviceStatus.busy
source: 忙碌
en: Busy

# spaceList.deviceStatus.offline
source: 离线
en: Offline

# spaceList.deviceStatus.unknown
source: 状态未知
en: Unknown

# agent.capsule.menu.text
source: 文字
en: Text

# agent.capsule.menu.voice
source: 语音
en: Voice

# agent.capsule.menu.textA11y
source: 选择文字输入
en: Choose text input

# agent.capsule.menu.voiceA11y
source: 选择语音输入
en: Choose voice input

# agent.capsule.onboarding.tap.title
source: 轻点，展开对话
en: Tap to open chat

# agent.capsule.onboarding.tap.detail
source: 查看 Agent 的完整回复
en: See the Agent's full response

# agent.capsule.onboarding.drag.title
source: 拖动，调整位置
en: Drag to reposition

# agent.capsule.onboarding.drag.detail
source: 松手后自动吸附到屏幕边缘
en: Release to snap to the nearest edge

# agent.capsule.onboarding.hold.title
source: 长按，快速输入
en: Long-press for quick input

# agent.capsule.onboarding.hold.detail
source: 选择文字或语音输入
en: Choose text or voice input

# agent.capsule.onboarding.skip
source: 跳过
en: Skip

# agent.capsule.onboarding.settings.section
source: 操作教学
en: Interaction Guides

# agent.capsule.onboarding.replay.title
source: 重新播放胶囊教学
en: Replay capsule guide

# agent.capsule.onboarding.replay.detail
source: 下次胶囊出现时从轻点开始
en: Starts the next time the capsule appears

# agent.capsule.onboarding.replay.done
source: 胶囊教学已重置
en: Capsule guide reset

# agent.conversationLayer.grabber
source: 对话高度，上下拖动调整
en: Conversation height, drag up or down to adjust

# agent.conversationLayer.expand
source: 展开对话卡片
en: Expand conversation card

# agent.conversationLayer.collapse
source: 收起对话
en: Collapse conversation

# agent.capsule.textComposer.placeholder
source: 发消息…
en: Message…

# agent.capsule.textComposer.sendA11y
source: 发送消息
en: Send message

# agent.capsule.a11y.returnChat
source: 展开对话
en: Open chat

# agent.capsule.a11y.startVoice
source: 开始语音指令
en: Start voice command

# agent.capsule.a11y.endAndSend
source: 结束并发送
en: End and send

# agent.capsule.a11y.cancelVoice
source: 取消语音
en: Cancel voice

# agent.capsule.voice.cancel
source: 取消
en: Cancel

# agent.capsule.voice.send
source: 发送
en: Send

# agent.capsule.voice.listeningHint
source: 开始说话，说完点发送…
en: Start speaking, then tap Send…

# agent.noAgents
source: 暂无工作空间
en: No Workspaces

# agent.noAgentsDescription
source: 在桌面端创建工作空间后 这里会自动显示
en: Create a Workspace on desktop and it will appear here

# agent.viewAllSessions
source: 查看全部会话
en: View all conversations

# agent.resourcesSection
source: 资源
en: Resources

# agent.conversationsSection
source: 会话
en: Conversations

# agent.resourceNotOpenable
source: 暂不支持在此打开
en: Not openable on iOS yet

# agent.noResourcesOfType.named
source: 还没有 %@ 资源
en: No %@ resources yet

# agent.edit
source: 编辑
en: Edit

# agent.editTitle
source: 编辑工作空间
en: Edit Workspace

# agent.editNamePlaceholder
source: 名称
en: Name

# agent.editDescriptionPlaceholder
source: 描述（可选）
en: Description (optional)

# agent.archive
source: 归档
en: Archive

# agent.archiveConfirm.named
source: 归档「%@」？之后可以在已归档列表中恢复。
en: Archive "%@"? You can restore it later from Archived.

# agent.session.archive
source: 归档
en: Archive

# agent.session.archiveConfirm.named
source: 确定要归档会话「%@」吗？之后可在归档会话中恢复。
en: Archive conversation "%@"? You can restore it later from Archived Sessions.

# agent.delete
source: 删除
en: Delete

# agent.deleteConfirm.named
source: 删除「%@」？此操作不可恢复。
en: Delete "%@"? This cannot be undone.

# agent.workspaceNotFound
source: 未找到工作空间
en: Workspace not found

# agent.newConversation
source: 新对话
en: New Conversation

# agent.conversationHistory
source: 对话历史
en: Conversation History

# agent.messageCount
source: %lld 条消息
en: %lld messages

# agent.noConversations
source: 暂无对话
en: No Conversations

# agent.noConversationsHint
source: 点击右上角 + 开始新话题
en: Tap + in the upper right to start a new conversation

# agent.createConversation
source: 新建对话
en: New Conversation

# agent.loadingSessions
source: 加载会话…
en: Loading sessions…

# agent.noHistory
source: 暂无历史对话
en: No Conversation History

# agent.sessionTitle
source: 对话 %@
en: Conversation %@

# agent.settings
source: 设置
en: Settings

# agent.settings.basicInfo
source: 基本信息
en: Basic Info

# agent.settings.icon
source: 图标
en: Icon

# agent.settings.name
source: 名称
en: Name

# agent.settings.namePlaceholder
source: Agent 名称
en: Agent name

# agent.settings.nameRequired
source: 名称不能为空
en: Name is required

# agent.settings.description
source: 描述
en: Description

# agent.settings.descriptionPlaceholder
source: 可选描述
en: Optional description

# agent.settings.customRules
source: 自定义规则
en: Custom Rules

# agent.settings.customRulesPlaceholder
source: Agent 在所有对话中遵循的规则，如身份与语气（“你是资深前端工程师”）、代码风格、回复语言偏好等
en: Rules the Agent follows in every conversation — identity and tone ("You are a senior frontend engineer"), code style, reply language, etc.

# agent.settings.customRulesHint
source: 设定 Agent 的身份与执行任务时的要求，它会在所有对话中严格遵循
en: Define the Agent's identity and how it should work; it follows these across all conversations

# agent.workType.title
source: 运行目录类型
en: Working Directory Type

# agent.workType.summaryPending
source: 待选择
en: To be set

# agent.workType.codeShort
source: 代码
en: Code

# agent.workType.docShort
source: 文档
en: Doc

# agent.workType.mixedShort
source: 混合
en: Mixed

# agent.workType.workingDirLabel
source: 工作目录
en: Working Directory

# agent.workType.workingDirHint
source: 工作目录在桌面端 / 设备上设置，移动端仅可调整目录类型。
en: The working directory is set on desktop / device. On mobile you can only change its type.

# agent.workType.noWorkingDir
source: 尚未设置工作目录。请先在电脑版 TabTin 的该 Agent 设置里选择工作目录，之后即可在这里选择目录类型。
en: No working directory yet. Set one for this Agent on the desktop app (its Agent settings → Working Directory) first, then you can choose its type here.

# agent.workType.sectionLabel
source: 目录类型
en: Directory Type

# agent.workType.sectionHint
source: 决定 Agent 默认怎么做事。它不会改变「安全」里的权限边界。
en: Sets how the Agent works by default for this kind of material. It does not change the permission boundaries under Security.

# agent.workType.pickHint
source: 已绑定工作目录，请选择一种类型后保存。
en: Working directory is set — choose a type and save.

# agent.workType.codeTitle
source: 代码项目
en: Code project

# agent.workType.codeDesc
source: 默认更谨慎：改代码前先理解链路，大改动或破坏性操作会先和你确认，收尾会检查（lint / test）。
en: More cautious by default: understands the flow before changing code, confirms big or destructive changes, runs lint / tests at the end.

# agent.workType.docTitle
source: 文档项目
en: Doc project

# agent.workType.docDesc
source: 默认面向写作与资料整理，强调结构、可读性与表达。
en: Geared toward writing and research; emphasizes structure, readability and expression.

# agent.workType.mixedTitle
source: 混合项目
en: Mixed project

# agent.workType.mixedDesc
source: 代码与文档兼顾，按当前材料选择合适的做事方式。
en: Balances code and docs; picks the right way of working based on the material at hand.

# agent.settings.dangerZone
source: 危险操作
en: Danger Zone

# agent.settings.archive
source: 归档
en: Archive

# agent.settings.archiveDesc
source: 归档此工作空间，之后可以恢复
en: Archive this Workspace, can be restored later

# agent.settings.archiveConfirm
source: 确定要归档此工作空间吗？
en: Are you sure you want to archive this Workspace?

# agent.settings.delete
source: 删除
en: Delete

# agent.settings.deleteDesc
source: 永久删除此工作空间及所有数据
en: Permanently delete this Workspace and all data

# agent.settings.deleteConfirm
source: 输入“%@”以确认删除
en: Enter "%@" to confirm deletion

# agent.settings.deleteWarning
source: 此操作不可撤销，所有对话、设置和数据将被永久删除。
en: This action cannot be undone. All conversations, settings and data will be permanently deleted.

# agent.settings.deleteNameMismatch
source: 输入的名称不匹配，请输入正确的名称以确认删除。
en: The name you entered does not match. Please enter the exact name to confirm deletion.

# agent.settings.saving
source: 保存中…
en: Saving…

# agent.settings.saved
source: 已保存
en: Saved

# agent.settings.saveFailed
source: 保存失败
en: Save failed

# agent.settings.defaultSpaceHint
source: 默认工作空间无法归档或删除
en: Default Workspace cannot be archived or deleted

# agent.settings.discardTitle
source: 放弃更改？
en: Discard Changes?

# agent.settings.discard
source: 放弃
en: Discard

# agent.settings.keepEditing
source: 继续编辑
en: Keep Editing

# agent.menu.settings
source: 设置
en: Settings

# agent.menu.archive
source: 归档
en: Archive

# agent.menu.delete
source: 删除
en: Delete

# agent.menu.archiveConfirm
source: 归档“%@”？
en: Archive "%@"?

# agent.menu.deleteConfirm
source: 删除“%@”？此操作不可撤销。
en: Delete "%@"? This action cannot be undone.

# agent.create
source: 新建工作空间
en: New Workspace

# agent.createTitle
source: 创建工作空间
en: Create Workspace

# agent.createNamePlaceholder
source: 工作空间名称
en: Workspace name

# agent.createFailed
source: 创建工作空间失败
en: Failed to create Workspace

# agent.session.archiveConfirm
source: 归档此对话？
en: Archive this conversation?

# agent.session.deleteConfirm
source: 删除此空对话？
en: Delete this empty conversation?

# agent.session.delete
source: 删除
en: Delete

# agent.session.archiveFailed
source: 归档对话失败
en: Failed to archive conversation

# agent.session.deleteFailed
source: 删除对话失败
en: Failed to delete conversation

# agent.operationFailed
source: 操作失败
en: Operation Failed

# agent.archivedSpaces
source: 已归档的工作空间
en: Archived Workspaces

# agent.archivedEmpty
source: 暂无归档的工作空间
en: No Archived Workspaces

# agent.restore
source: 恢复
en: Restore

# agent.restoreFailed
source: 恢复工作空间失败
en: Failed to restore Workspace

# agent.settings.deleteInputHint
source: 输入名称以确认
en: Enter name to confirm

# agent.createSessionBusy
source: 正在创建会话，请稍候
en: Creating session, please wait

# agent.createSessionFailed
source: 创建对话失败
en: Failed to create conversation

# agent.loadSessionsFailed
source: 加载会话失败
en: Failed to load sessions

# agent.archivedSessions
source: 已归档的对话
en: Archived Conversations

# agent.archivedSessionsEmpty
source: 暂无归档的对话
en: No Archived Conversations

# agent.session.restore
source: 恢复
en: Restore

# agent.session.restoreConfirm
source: 恢复此对话？
en: Restore this conversation?

# agent.session.restoreFailed
source: 恢复对话失败
en: Failed to restore conversation

# agent.session.deletePermanentConfirm
source: 永久删除此对话？此操作不可撤销。
en: Permanently delete this conversation? This action cannot be undone.

# agent.security
source: 授权策略
en: Authorization

# agent.security.preset
source: 预设模式
en: Preset

# agent.security.cautious
source: 谨慎
en: Cautious

# agent.security.cautiousDesc
source: 所有操作均需确认
en: All operations require confirmation

# agent.security.collaborative
source: 协作
en: Collaborative

# agent.security.collaborativeDesc
source: 读取操作自动执行，写入操作需确认
en: Read operations are automatic, write operations require confirmation

# agent.security.fullAuto
source: 全自动
en: Full Auto

# agent.security.fullAutoDesc
source: 大部分操作自动执行，高危操作（删除/脚本）仍需确认
en: Most operations run automatically; high-risk actions (delete/script) still require confirmation

# agent.security.serverAuto
source: 服务端自动
en: Server Auto

# agent.security.serverAutoDesc
source: 由服务端自动管理安全策略
en: Security policy managed automatically by the server

# agent.security.fineGrained
source: 细粒度规则
en: Fine-grained Rules

# agent.security.rule.read
source: 读取文件
en: Read Files

# agent.security.rule.write
source: 写入文件
en: Write Files

# agent.security.rule.install
source: 安装软件包
en: Install Packages

# agent.security.rule.deleteSystem
source: 删除系统文件
en: Delete System Files

# agent.security.rule.script
source: 执行脚本
en: Execute Scripts

# agent.security.auto
source: 自动
en: Auto

# agent.security.confirm
source: 确认
en: Confirm

# agent.security.terminalMode
source: 终端模式
en: Terminal Mode

# agent.security.term.tabtinOnly
source: 仅限 TabTin
en: TabTin Only

# agent.security.term.tabtinOnlyDesc
source: Agent 只能使用内置终端执行命令
en: Agent can only use the built-in terminal

# agent.security.term.sandboxed
source: 沙箱模式
en: Sandboxed

# agent.security.term.sandboxedDesc
source: 命令在隔离的沙箱环境中执行
en: Commands run in an isolated sandbox environment

# agent.security.term.regular
source: 常规模式
en: Regular

# agent.security.term.regularDesc
source: Agent 可以使用系统常规终端
en: Agent can use regular system terminal

# agent.security.term.blocked
source: 已禁止
en: Blocked

# agent.security.term.blockedDesc
source: 完全禁止终端访问
en: Terminal access is completely disabled

# agent.security.operationSwitches
source: 操作开关
en: Operation Switches

# agent.security.operationSwitchesHint
source: 对具体操作的细粒度控制。点击状态标签可在 允许 → 确认 → 阻止 之间切换。
en: Fine-grained control over specific operations. Tap the status badge to cycle through Allow → Confirm → Block.

# agent.security.operationSwitchesEmpty
source: 暂无操作开关配置
en: No operation switches configured

# agent.security.operationSwitchesAdd
source: 添加操作
en: Add Operation

# agent.security.switch.allow
source: 允许
en: Allow

# agent.security.switch.confirm
source: 确认
en: Confirm

# agent.security.switch.block
source: 阻止
en: Block

# agent.executionLimits.title
source: 执行限制
en: Execution Limits

# agent.executionLimits.desc
source: 控制 Agent 单次运行的资源消耗上限
en: Limit resource consumption per Agent run

# agent.executionLimits.maxIterations
source: 最大迭代次数
en: Max Iterations

# agent.executionLimits.maxIterationsDesc
source: 单次运行中 Agent 的最大思考-行动循环次数
en: Max think-act loop iterations per run

# agent.executionLimits.maxIterationsPlaceholder
source: 默认: 200
en: Default: 200

# agent.executionLimits.maxCredits
source: 最大消费（credits）
en: Max Credits

# agent.executionLimits.maxCreditsDesc
source: 单次运行中 Agent 的最大 credits 消费
en: Max credit consumption per run

# agent.executionLimits.maxCreditsPlaceholder
source: 默认: 50
en: Default: 50

# agent.executionLimits.useDefault
source: 留空即使用默认值
en: Leave empty to use default values

# agent.capabilities.title
source: 应用与能力
en: Capabilities

# agent.skills.title
source: Skill
en: Skills

# agent.skills.subtitle
source: 管理 Agent Skill 和能力
en: Manage agent skills and abilities

# agent.skills.empty
source: 暂无 Skill
en: No Skills

# agent.skills.emptyDesc
source: 可以在桌面端添加 Skill。
en: Skills can be added from the desktop app.

# agent.memory.title
source: Tin 的记忆
en: Memory

# agent.memory.subtitle
source: 跨工作空间的持续记忆
en: Persistent memory across Workspaces

# agent.memory.description
source: Tin 会沉淀你们的对话、Tin 帮你做的事和你写的笔记——跨工作空间、跨日持续记忆。
en: Tin remembers what you talk about, what it does for you, and the notes you keep — across Workspaces and days.

# agent.memory.enable
source: 启用记忆
en: Enable Memory

# agent.memory.enableHint
source: 允许 Tin 跨对话记忆信息
en: Allow Tin to remember information across conversations

# agent.memory.saved
source: 已保存
en: Saved

# agent.memory.session.title
source: 长对话处理
en: Long Conversations

# agent.memory.session.autoSummary
source: 自动摘要
en: Auto Summarize

# agent.memory.session.autoSummaryHint
source: 对话压力大时自动总结窗口
en: Summarize the window automatically when conversation pressure is high

# agent.userPortrait.title
source: 关于你
en: About You

# agent.userPortrait.enableHint
source: Tin 会随着对话沉淀关于你的画像
en: Tin will build a portrait of you as you chat

# agent.userPortrait.disabled
source: 已关闭
en: Turned off

# agent.userPortrait.noOrganization
source: 请先选择组织
en: Pick an Organization first

# agent.userPortrait.lastDistilled
source: 上次蒸馏：
en: Last distilled:

# agent.userPortrait.neverDistilled
source: 从未
en: Never

# agent.userPortrait.justNow
source: 刚刚
en: Just now

# agent.userPortrait.minAgo
source: %lld 分钟前
en: %lld min ago

# agent.userPortrait.hourAgo
source: %lld 小时前
en: %lld h ago

# agent.userPortrait.dayAgo
source: %lld 天前
en: %lld d ago

# agent.userPortrait.distillNow
source: 立即整理
en: Distill Now

# agent.userPortrait.organizationScope
source: 组织：%@
en: Organization: %@

# agent.userPortrait.organizationScopeFallback
source: 当前组织
en: Current Organization

# agent.userPortrait.empty.title
source: 还没生成画像
en: No portrait yet

# agent.userPortrait.empty.hint
source: 可以跟 Tin 多聊几句，或者在下方留个 hint。 Tin 会把对你的了解总结到这里。
en: Chat with Tin a bit, or drop a hint below. Tin will summarize what they learn about you.

# agent.userPortrait.distilling.title
source: 正在整理画像...
en: Distilling...

# agent.userPortrait.distilling.hint
source: 通常几秒钟
en: Usually a few seconds

# agent.userPortrait.hint.label
source: 给 Tin 一个 hint
en: Give Tin a hint

# agent.userPortrait.hint.placeholder
source: 告诉 Tin 一些能让他更懂你的事...
en: Tell Tin something that helps them understand you better...

# agent.userPortrait.hint.submit
source: 提交
en: Submit

# agent.userPortrait.hint.submitFailed
source: 提交失败
en: Failed to submit

# agent.userPortrait.hint.softLimit
source: 超过 %lld 字的 hint 可能被截断
en: Long hints (over %lld chars) may be trimmed

# agent.userPortrait.hint.hardLimit
source: 超过 %lld 字，请缩短
en: Too long (over %lld chars), please shorten

# agent.userPortrait.distillScheduled
source: 已安排整理，Tin 正在分析...
en: Scheduled — Tin is analyzing...

# agent.userPortrait.distillSkipped
source: 无新内容，跳过整理
en: Nothing new to distill

# agent.userPortrait.loadFailed.title
source: 加载失败
en: Load failed

# agent.userPortrait.loadFailed.hint
source: 网络或服务异常，可点击重试。
en: Network or server issue — try again.

# agent.userPortrait.loadFailed.retry
source: 重试
en: Retry

# agent.userPortrait.failed.title
source: 整理失败
en: Distill failed

# agent.userPortrait.failed.retry
source: 重试整理
en: Retry distill

# agent.userPortrait.stillDistilling.title
source: 仍在整理中
en: Still distilling

# agent.userPortrait.stillDistilling.hint
source: 后端可能仍在处理，可手动刷新查看进度
en: Backend may still be processing — refresh manually to check progress

# agent.userPortrait.stillDistilling.refresh
source: 刷新
en: Refresh

# agent.subagent.title
source: 子 Agent
en: Sub Agents

# agent.subagent.subtitle
source: 预定义专用子 Agent，当前 Agent 执行任务时可按名称调用
en: Pre-defined sub agents that the current agent can invoke by name

# agent.subagent.empty
source: 暂无子 Agent
en: No Sub Agents

# agent.subagent.emptyHint
source: 创建专用子 Agent 来增强当前 Agent 的任务执行能力
en: Create specialized sub agents to enhance the current agent's task execution capabilities

# agent.subagent.create
source: 新建
en: Create

# agent.subagent.createTitle
source: 创建子 Agent
en: Create Sub Agent

# agent.subagent.editTitle
source: 编辑子 Agent
en: Edit Sub Agent

# agent.subagent.name
source: 名称
en: Name

# agent.subagent.namePlaceholder
source: 如：代码审查专家、数据分析师
en: e.g. Code Reviewer, Data Analyst

# agent.subagent.description
source: 用途描述
en: Description

# agent.subagent.descPlaceholder
source: 描述这个子 Agent 的专长和适用场景
en: Describe the specialty and use cases

# agent.subagent.systemPrompt
source: 角色设定
en: System Prompt

# agent.subagent.systemPromptPlaceholder
source: 定义子 Agent 的身份、能力和行为规则
en: Define the identity, capabilities and behavior rules

# agent.subagent.taskRole
source: 任务角色
en: Task Role

# agent.subagent.mode
source: 执行模式
en: Execution Mode

# agent.subagent.thinkingLevel
source: 思维级别
en: Thinking Level

# agent.subagent.enabled
source: 启用
en: Enabled

# agent.subagent.typeExplore
source: 探索
en: Explore

# agent.subagent.typePlan
source: 规划
en: Plan

# agent.subagent.typeExecute
source: 执行
en: Execute

# agent.subagent.modeWait
source: 等待完成
en: Wait

# agent.subagent.modeBackground
source: 后台执行
en: Background

# agent.subagent.deleteConfirm
source: 删除子 Agent
en: Delete Sub Agent

# agent.subagent.deleteWarning
source: 将永久删除该子 Agent 模板，此操作不可恢复。
en: This will permanently delete the sub agent template. This action cannot be undone.

# agent.subagent.toggleFailed
source: 切换状态失败
en: Failed to toggle status

# agent.trash.title
source: 回收站
en: Trash

# agent.trash.description
source: 已删除的项目将保留 30 天后自动永久清除。
en: Deleted items are kept for 30 days before permanent removal.

# agent.trash.empty
source: 回收站为空
en: Trash is empty

# agent.trash.emptyTrash
source: 清空回收站
en: Empty Trash

# agent.trash.emptyConfirm
source: 确定要永久删除回收站中的所有项目吗？此操作不可恢复。
en: Are you sure you want to permanently delete all items in the trash? This action cannot be undone.

# agent.trash.emptyMessage
source: 将永久删除 %lld 个项目，此操作不可撤销。
en: Permanently delete %lld items. This action cannot be undone.

# agent.trash.restore
source: 恢复
en: Restore

# agent.trash.restored
source: 已恢复
en: Restored

# agent.trash.restoreFailed
source: 恢复失败
en: Restore failed

# agent.trash.deletePermanent
source: 永久删除
en: Delete Permanently

# agent.trash.deleteConfirm
source: 确定要永久删除该项目吗？此操作不可恢复。
en: Are you sure you want to permanently delete this item? This action cannot be undone.

# agent.trash.deleted
source: 已删除
en: Deleted

# agent.trash.deleteFailed
source: 删除失败
en: Delete failed

# agent.trash.daysLeft
source: 剩余 %lld 天
en: %lld days left

# agent.trash.itemCount
source: %lld 项
en: %lld items

# agent.trash.type.document
source: 文档
en: Document

# agent.trash.type.table
source: 表格
en: Table

# agent.trash.type.slide
source: 幻灯片
en: Slide

# agent.trash.type.design
source: 设计
en: Design

# agent.trash.type.video
source: 视频
en: Video

# agent.trash.type.code
source: 代码
en: Code

# agent.trash.type.memo
source: 备忘录
en: Memo

# agent.trash.type.canvas
source: 画布
en: Canvas

# agent.archivedSessions.title
source: 归档会话
en: Archived Sessions

# agent.archivedSessions.description
source: 归档的会话不会出现在对话列表中。左滑恢复。
en: Archived sessions are hidden from the conversation list. Swipe right to restore.

# agent.archivedSessions.emptyList
source: 暂无归档会话
en: No archived sessions

# agent.archivedSessions.deleteConfirm
source: 确定要永久删除该会话吗？此操作不可恢复。
en: Are you sure you want to permanently delete this session? This action cannot be undone.

# agent.settings.memory
source: 记忆
en: Memory

# agent.settings.memoryHint
source: 跨会话记忆策略
en: Cross-session memory settings

# agent.settings.subagents
source: 子 Agent
en: Sub Agents

# agent.settings.subagentsHint
source: 应用与能力
en: Capabilities

# agent.settings.management
source: 管理
en: Management

# agent.settings.archivedSessions
source: 归档会话
en: Archived Sessions

# agent.runtime.execution.detail
source: 执行详情
en: Execution details

# agent.runtime.execution.detailHint
source: 轻点查看执行详情
en: Double tap to view execution details

# agent.runtime.execution.failedCount.count
source: %d 个失败
en: %d failed

# agent.runtime.execution.stepCount.count
source: %d 步
en: %d steps

# agent.runtime.execution.stepFailed
source: 失败
en: Failed

# agent.runtime.execution.suspicious
source: 检测到可疑输出
en: Suspicious output detected

# agent.runtime.thinking.inProgress
source: 思考中…
en: Thinking…

# agent.runtime.thinking.planningNext
source: 正在计划下一步...
en: Planning next step…

# agent.runtime.thinking.completed
source: 思考完成
en: Thought

# agent.runtime.thinking.completedIn.seconds
source: 思考了 %d 秒
en: Thought for %d sec
